# Sql Practice on hackerrank

My Profile on hackerrank : https://www.hackerrank.com/ayse_2998?hr_r=1

## CITY TABLE

| Field | Type |
| --- | --- | 
| ID| NUMBER|
|NAME |VARCHAR(17)|
| COUNTRYCODE | VarChar(2)|
|DISTRICT|VARCHAR2(20)|
|POPULATION|NUMER|

**Query I: Query all columns for all American cities in CITY with populations larger than 100000. The CountryCode for America is USA**

`SOLUTION`
```SQL
SELECT *
FROM CITY
WHERE COUNTRYCODE = 'USA'
AND POPULATION >100000;
```
```python
#Output
3878 Scottsdale USA Arizona 202705 
3965 Corona USA California 124966 
3973 Concord USA California 121780 
3977 Cedar Rapids USA Iowa 120758 
3982 Coral Springs USA Florida 117549 

```

**Query II: Query the names of all American cities in CITY with populations larger than 120000. The CountryCode for America is USA.**

`SOLUTION`
```SQL
SELECT NAME
FROM CITY
WHERE COUNTRYCODE ='USA'
AND  POPULATION > 120000
```
```python
#OUTPUT
Scottsdale
Corona
Concord
Cedar Rapids
```

**Query III : Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.**

`SOLUTION`
```SQL
SELECT *
FROM CITY
WHERE COUNTRYCODE ='JPN'
```
```python
#OUTPUT
1613 Neyagawa JPN Osaka 257315 
1630 Ageo JPN Saitama 209442 
1661 Sayama JPN Saitama 162472 
1681 Omuta JPN Fukuoka 142889 
1739 Tokuyama JPN Yamaguchi 107078
```

## STATION TABLE
|Field|Type|
|---|---|
|ID|NUMBER|
|CITY|VARCHAR2(21)|
|STATE|VARCHAR2(2)|
|LAT_N|NUMBER|
|LONG_W|NUMBER|
*where LAT_N is the northern latitude and LONG_W is the western longitude*

**QUERY 1 : Query a list of CITY and STATE from the STATION table.**
`SOLUTION`

```SQL
SELECT CITY, STATE
FROM STATION;
```
```python
#OUTPUT
Kissee Mills MO 
Loma Mar CA 
Sandy Hook CT 
Tipton IN 
Arlington CO 
Turner AR 
Slidell LA 
Negreet LA 
Glencoe KY 
Chelsea IA 
.......

```

**QUERY 2: Query a list of CITY names from STATION with even ID numbers only. You may print the results in any order, but must exclude duplicates from your answer.**

`SOLUTION`
```SQL
SELECT DISTINCT CITY 
FROM STATION
WHERE (ID %2 ) =0
```
```python
#OUTPUT
Kissee Mills 
Loma Mar 
Tipton 
Glencoe 
Chignik Lagoon 
.....

```

**QUERY 3: Let  `N` be the number of `CITY `entries in `STATION`, and let `N1` be the number of distinct CITY names in STATION; query the value` N- N1` of  from STATION. In other words, find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.**

`SOLUTION`
```SQL
SELECT (COUNT(CITY) - COUNT(DISTINCT  CITY))
FROM STATION
```
```python
#OUTPUT
13
```

#### QUERY 4 : Query the two cities in `STATION` with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

`SOLUTION`
```SQL

SELECT CITY, LENGTH(CITY)
FROM STATION
ORDER BY  LENGTH(CITY), CITY
LIMIT 1;
SELECT CITY,  LENGTH(CITY)
FROM STATION
ORDER BY  LENGTH(CITY) DESC, CITY
LIMIT 1;
```
```python
#OUTPUT
Amo 3 
Marine On Saint Croix 21 
```

**QUERY 5: Query the list of CITY names `starting with vowels` (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.**
`SOLUTION`
```SQL
SELECT DISTINCT CITY
FROM STATION
WHERE CITY REGEXP '^[aeiou]'
```
```python
Arlington 
Albany 
Upperco 
Aguanga 
Odin 
East China 
Algonac 
Onaway 
Irvington 
.......
```

**QUERY 6: Query the list of CITY names `ending with vowels` (a, e, i, o, u) from STATION. Your result cannot contain duplicates.**
`SOLUTION`
```SQL
SELECT DISTINCT CITY FROM STATION
WHERE CITY REGEXP '[aeiou]$';
```
OR

```SQL
SELECT DISTINCT CITY FROM STATION
WHERE RIGHT(CITY, 1) IN ('a','e','i','o','u');
```
```python
Glencoe 
Chelsea 
Pelahatchie 
Dorrance 
Cahone 
Upperco  
.........
```

**QUERY 7: Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.**
`SOLUTION`
```SQL
SELECT DISTINCT CITY from STATION
WHERE LEFT(CITY,1) IN ('a','e','i','o','u') 
AND RIGHT(CITY, 1) IN ('a','e','i','o','u');

```
OR
```SQL
SELECT DISTINCT CITY from STATION
WHERE CITY REGEXP '^[aeiou]'
AND CITY REGEXP '[aeiou]$'
```
```python
#OUTPUT
Upperco 
Aguanga 
East China 
East Irvine 
Amo 
Eleele 
Oconee 
........
```

**QUERY 8: Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.**

`SOLUTION`
```SQL
SELECT DISTINCT CITY
FROM  STATION
WHERE CITY REGEXP '^[^aeiou]';
```
```python
#OUTPUT
Kissee Mills 
Loma Mar 
Sandy Hook 
Tipton 
Turner 
.....

```

#### QUERY 9: Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

`SOLUTION`
```SQL
SELECT DISTINCT CITY
FROM STATION
WHERE CITY NOT REGEXP '[aeiou]$'
```
```python
#OUTPUT
Kissee Mills 
Loma Mar 
Sandy Hook 
Tipton 
Arlington 
Turner 
......
```

## PROJECT TABLE
You are given a table, Projects, containing three columns: Task_ID, Start_Date and End_Date. It is guaranteed that the difference between the End_Date and the Start_Date is equal to 1 day for each row in the table.
    
|Column|Type|
|---|---|
|Task_ID|Integer|
|Start_Date|Date|
|End_Date|Date|

If the End_Date of the tasks are consecutive, then they are part of the same project. Samantha is interested in finding the total number of different projects completed.

|Task_ID|Star_Date|End_Date|
|---|---|---|
|1|2015-10-01|2015-10-02|
|2|2015-10-02||
|3|2015-10-03||
|4|2015-10-13||
|5|2015-10-14||
|6|2015-10-28||
|7|2015-10-30||

#### QUERY 1: Write a query to output the start and end dates of projects listed by the number of days it took to complete the project in ascending order. If there is more than one project that have the same number of completion days, then order by the start date of the project.
`SOLUTION`
```SQL
SET sql_mode = '';
SELECT Start_Date, End_Date
FROM 
    (SELECT Start_Date FROM Projects WHERE Start_Date NOT IN (SELECT End_Date FROM Projects )) a,
    (SELECT End_Date FROM Projects WHERE End_Date NOT IN (SELECT Start_Date FROM Projects)) b
WHERE Start_Date < End_Date
GROUP BY Start_Date
ORDER BY DATEDIFF(End_Date,Start_Date) , Start_Date;
```
```python
#OUTPUT
2015-10-15 2015-10-16 
2015-10-17 2015-10-18 
2015-10-19 2015-10-20 
2015-10-21 2015-10-22 
2015-11-01 2015-11-02 
2015-11-17 2015-11-18 
2015-10-11 2015-10-13 
2015-11-11 2015-11-13 
2015-10-01 2015-10-05 
2015-11-04 2015-11-08 
2015-10-25 2015-10-31

```

## Students, Friends, Packages TABLES
You are given three tables: Students, Friends and Packages. Students contains two columns: ID and Name. Friends contains two columns: ID and Friend_ID (ID of the ONLY best friend). Packages contains two columns: ID and Salary (offered salary in $ thousands per month).


|Column|Type|
|---|---|
|ID|Integer|
|Name|String|
`Students`

|Column|Type|
|---|---|
|ID|Integer|
|Friend_ID|Integer|
`Friends`

|Column|Type|
|---|---|
|ID|Integer|
|Salary|Float|
`Packages`

#### QUERY: Write a query to output the names of those students whose best friends got offered a higher salary than them. Names must be ordered by the salary amount offered to the best friends. It is guaranteed that no two students got same salary offer.

|ID|1|2|3|4|
|---|---|---|---|---|
|Name|Ashley|Samantha|Julia|Scarlet|
|Salary|15.20|10.06|11.55|12.12|
|Friend ID|2|3|4|1|
|Friend Salary|10.06|11.55|12.12|15.20|

Now,

* Samantha's best friend got offered a higher salary than her at 11.55
* Julia's best friend got offered a higher salary than her at 12.12
* Scarlet's best friend got offered a higher salary than her at 15.2
* Ashley's best friend did NOT get offered a higher salary than her
* The name output, when ordered by the salary offered to their friends, will be:

    * Samantha
    * Julia
    * Scarlet

`SOLUTION`
```SQL
SELECT S.Name
FROM (Students AS S JOIN Friends AS F USING(ID))
    JOIN Packages AS P1 ON S.ID = P1.ID
    JOIN Packages AS P2 ON F.Friend_ID = P2.ID
WHERE P2.Salary > P1.salary  
ORDER BY P2.Salary;  
```
```python
#OUTPUT
Stuart 
Priyanka 
Paige 
Jane 
Julia 
Belvet 
Amina 
Kristeen 
Scarlet 
Priya 
Meera 
```

Samantha was tasked with calculating the average monthly salaries for all employees in the EMPLOYEES table, but did not realize her keyboard's  key was broken until after completing the calculation. She wants your help finding the difference between her miscalculation (using salaries with any zeroes removed), and the actual average salary.

Write a query calculating the amount of error (i.e.:  average monthly salaries), and round it up to the next integer.

#### Top Earners

We define an employee's total earnings to be their monthly $salary X mounts$ worked, and the maximum total earnings to be the maximum total earnings for any employee in the Employee table. Write a query to find the maximum total earnings for all employees as well as the total number of employees who have maximum total earnings. Then print these values as 2 space-separated integers.

Input Format

The `Employee table` containing employee data for a company is described as follows:

|Column|Type|
|---|---|
|employee_id|integer|
|name|string|
|months|integer|
|salary|integer|

where `employee_id` is an employee's ID number, name is their name, months is the total number of months they've been working for the company, and salary is the their monthly salary.

Sample input:

|employee_id|name|months|salary|
|---|---|---|---|
|330| Rose| 5| 2248| 
|1233| Angela |7 |1296|
|1901| Frank| 10 |2763|
|2035| Patrick| 1 |4583|
|2405| Lisa| 7 |4350| 
|2974| Kimberly| 11 |2874| 
|3190| Bonnie| 11| 3758| 
|3506| Michael| 9 |1936| 
|3708| Todd| 22| 4046| 

Sample Output<br>
```python
#OUTPUT
69952 1
```
`SOLUTION`
```SQL
SELECT MAX(salary * months),COUNT(employee_id) 
FROM Employee 
WHERE (salary * months) = (SELECT MAX(salary * months) FROM Employee) 

```
```python
#OUTPUT
108064 7
```

**Weather Observation Station**

|Field|Type|
|---|---|
|ID|NUMBER|
|CITY|VARCHAR2(21)|
|STATE|VARCHAR2(2)|
|LAT_N|NUMBER|
|LONG_W|NUMBER|

*where LAT_N is the northern latitude and LONG_W is the western longitude*

**Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7880 and less than 137.2345 . Truncate your answer to  decimal places.**

`SOLUTION`
```SQL
SELECT ROUND(SUM(LAT_N),4)
FROM station
WHERE LAT_N>38.7880 AND LAT_N<137.2345 
```
```python
#OUTPUT
36354.8135
```

**Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than 137.2345. Truncate your answer to  decimal places.**
`SOLUTION`
```SQL
SELECT ROUND(LAT_N,4)
FROM STATION
WHERE LAT_N <137.2345
ORDER BY LAT_N DESC
LIMIT 1;
```
```python
#OUTPUT
137.0193 
```

`SOLUTION`
```SQL

```
```python
#OUTPUT

```

**Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than 137.2345. Round your answer to  decimal places.**

`SOLUTION`
```SQL
SELECT ROUND(LONG_W,4)
FROM STATION
WHERE LAT_N <137.2345
ORDER BY LAT_N DESC LIMIT 1;
```
```python
#OUTPUT
117.2465
```

**Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7780 . Round your answer to  decimal places.**
`SOLUTION`
```SQL
SELECT ROUND(LAT_N,4) 
FROM STATION
WHERE LAT_N > 38.7780 
ORDER BY LAT_N LIMIT 1;
```
```python
#OUTPUT
38.8526
```

**Query the Western Longitude (LONG_W)where the smallest Northern Latitude (LAT_N) in STATION is greater than 38.7780. Round your answer to  decimal places.**

`SOLUTION`
```SQL

```
```python
#OUTPUT

```